##通过**i**来筛选数据集的行
###通过数字来筛选数据集的行
选取第三行到第五行
```r
> DT[3:5,] #or DT[3:5]
V1 V2 V3 V4
1: 1 C -1.0604 3
2: 2 A 0.6651 4
3: 1 B -1.1727 5
```
###基于使用快速自动索引条件，使用列名选择行i
在V2这一列，选择所有值为A的行
```r
> DT[ V2 == "A"]
V1 V2 V3 V4
1: 1 A -1.1727 1
2: 2 A 0.6651 4
3: 1 A -1.0604 7
4: 2 A -0.3825 10
```

###选择多个值:
选择在这一列中包含value1或value2的所有值
```r
> DT[column %in% c("value1","value2")]
```
选择V2这列中包含值A或C的所有行
```r
> DT[ V2 %in% c("A","C")]
V1 V2      V3 V4
1:  1  A  0.3408  1
2:  2  A -0.7460  4
3:  1  A -0.3795  7
4:  2  A -0.7033 10
5:  1  C -0.3795  3
6:  2  C -0.7033  6
7:  1  C  0.3408  9
8:  2  C -0.7460 12
```


